# Описание этапов разработки разворачивания программы PyMailGUI 3.0

# ----------------------------------- TODO ----------------------------------- #

# [x] Определить текущую рабочую папку (CWD)
# [x] Определить путь файлов Python в системе
# [x] Создать файл пути .pth и поместить его в соответствующий путь Python текущей версии
# [ ] Отсканировать 'from' и 'import' из SharedNames.py
# [ ] Найти только пути для самописных модулей
# [ ] Создать систему папок в CWD
# [ ] Распределить файлы модулей по папкам
# [?] Запустить setup_config.py